app/Controllers/Request.php

    public function show($id=null){

        $model = new ModelRequestProd();
        $data = $model->getWhere(['id_req_prod'=> $id])->getResult();
---
SELECT *
FROM `tbl_req_prod`
WHERE `id_req_prod` = '35'