app/Models/ModelAuth.php

SELECT *
FROM `authentikasi`
WHERE `email` = 'Ridwan@gmail.com'
 LIMIT 1
---
    function getEmail($email){
        $builder = $this->table('authentikasi');
        $data = $builder->where('email', $email)->first();